<?php


class Prepisovac {
    private static $prepis = [
        'runy' => [
            'A' => 'ᚨ', 'B' => 'ᛒ', 'C' => 'ᚲ', 'D' => 'ᛞ', 'E' => 'ᛖ',
            'F' => 'ᚠ', 'G' => 'ᚷ', 'H' => 'ᚺ', 'I' => 'ᛁ', 'J' => 'ᛃ',
            'K' => 'ᚲ', 'L' => 'ᛚ', 'M' => 'ᛗ', 'N' => 'ᚾ', 'O' => 'ᛟ',
            'P' => 'ᛈ', 'Q' => 'ᛩ', 'R' => 'ᚱ', 'S' => 'ᛊ', 'T' => 'ᛏ',
            'U' => 'ᚢ', 'V' => 'ᚡ', 'W' => 'ᚹ', 'X' => 'ᛪ', 'Y' => 'ᛇ',
            'Z' => 'ᛉ'
        ],
        'hlaholice' => [
            'A' => 'Ⰰ', 'B' => 'Ⰱ', 'V' => 'Ⰲ', 'G' => 'Ⰳ', 'D' => 'Ⰴ',
            'E' => 'Ⰵ', 'Ž' => 'Ⰶ', 'Z' => 'Ⰷ', 'I' => 'Ⰸ', 'J' => 'Ⰹ',
            'K' => 'Ⰽ', 'L' => 'Ⰾ', 'M' => 'Ⰿ', 'N' => 'Ⱀ', 'O' => 'Ⱁ',
            'P' => 'Ⱂ', 'R' => 'Ⱃ', 'S' => 'Ⱄ', 'T' => 'Ⱅ', 'U' => 'Ⱆ',
            'F' => 'Ⱇ', 'H' => 'Ⱈ', 'C' => 'Ⱌ', 'Č' => 'Ⱍ'
        ],
        'hieroglyfy' => [
            'A' => '𓄿', 'B' => '𓃀', 'C' => '𓍿', 'D' => '𓂧', 'E' => '𓇌',
            'F' => '𓆑', 'G' => '𓎼', 'H' => '𓉔', 'I' => '𓇋', 'J' => '𓏭',
            'K' => '𓎡', 'L' => '𓃭', 'M' => '𓅓', 'N' => '𓈖', 'O' => '𓍯',
            'P' => '𓊪', 'Q' => '𓐍', 'R' => '𓂋', 'S' => '𓋴', 'T' => '𓏏',
            'U' => '𓅱', 'V' => '𓆑', 'W' => '𓏲', 'X' => '𓐙', 'Y' => '𓇌',
            'Z' => '𓊃'
        ]
    ];

    public static function prepis($text, $typ) {
        $text = strtoupper($text);
        $vysledek = '';

        foreach (str_split($text) as $znak) {
            $vysledek .= self::$prepis[$typ][$znak] ?? $znak;
        }

        return $vysledek;
    }
}